<?php

$title = "lesson18";

//////////////////////////////////////////// Задание 1///////////////////////////////////////////////////////////////////

function fun1()
{
    $i = 0;
    do {
        if ($i == 0) {
            echo $i . ' – это ноль.';
        } elseif ($i % 2 == 0) {
            echo $i . ' – чётное число.';
        } else {
            echo $i . ' – нечётное число.';
        }
        echo '<br>';
        $i++;
    } while ($i <= 10);
}

//////////////////////////////////////////// Задание 2///////////////////////////////////////////////////////////////////

$dict = [
    'Московская область' => [
        'Москва',
        'Зеленоград',
        'Клин'
    ],
    'Ленинградская область' => [
        'Санкт-Петербург',
        'Всеволожск',
        'Павловск',
        'Кронштадт'
    ],
    'Рязанская область' => [
        'Рязань',
        'Скопин',
        'Рыбное',
        'Шилово',
        'Новомичуринск'
    ],
    'Красноярский край' => [
        'Красноярск',
        'Кодинск',
        'Канск',
        'Енисейск',
        'Норильск'
    ]
];
function fun2($dict)
{
    foreach ($dict as $reg => $cities) {
        echo "<h4>{$reg}:<br></h4>";
        echo implode(', ', $cities) . '.';
        echo '<br>';
    }
}

//////////////////////////////////////////// Задание 3///////////////////////////////////////////////////////////////////

$text = 'защищающийся бобёр сломалъ челюсть';

function fun3($text)
{
    $letters = array(
        'а' => 'a', 'б' => 'b', 'в' => 'v',
        'г' => 'g', 'д' => 'd', 'е' => 'e',
        'ё' => 'yo', 'ж' => 'zh', 'з' => 'z',
        'и' => 'i', 'й' => 'j', 'к' => 'k',
        'л' => 'l', 'м' => 'm', 'н' => 'n',
        'о' => 'o', 'п' => 'p', 'р' => 'r',
        'с' => 's', 'т' => 't', 'у' => 'u',
        'ф' => 'f', 'х' => 'x', 'ц' => 'c',
        'ч' => 'ch', 'ш' => 'sh', 'щ' => 'shh',
        'ъ' => '``', 'ы' => 'y', 'ь' => '`',
        'э' => 'e`', 'ю' => 'yu', 'я' => 'ya'
    );
    $chars = preg_split('//u', $text, -1, PREG_SPLIT_NO_EMPTY);
    $res = '';
    foreach ($chars as $val) {
        $res .= isset($letters[$val]) ? $letters[$val] : $val;
    }
    return $res;
}

//////////////////////////////////////////// Задание 4///////////////////////////////////////////////////////////////////

$menu =  [
    [
        'title' => 'Продукт 1',
        'link' => 'menu_1',
        'children' => [[
            'title' => 'Подпродукт 1',
            'link' => 'menu_1-1',
            'children' => [
                [
                    'title' => 'Подподпродукт 1.1',
                    'link' => 'menu_1-1-1',
                    'children' => [
                        [
                            'title' => 'Подподподпродукт 1.1.1',
                            'link' => 'menu_1-1-1-1',
                        ]
                    ]
                ]
            ],
            'title' => 'Подпродукт 2',
            'link' => 'menu_1-2',
            'children' => [
                [
                    'title' => 'Подподпродукт 2.1',
                    'link' => 'menu_1-2-1',
                    'children' => [
                        [
                            'title' => 'Подподподпродукт 2.1.1',
                            'link' => 'menu_1-2-1-1',
                        ],
                        [
                            'title' => 'Подподподпродукт 2.1.2',
                            'link' => 'menu_1-2-1-2',
                        ]
                    ]
                ]
            ]
        ]],
    ],
    [
        'title' => 'Продукт 2',
        'link' => 'menu_2',
        'children' => [
            [
                'title' => 'Подпродукт 1',
                'link' => 'menu_2-1',
                'children' => [
                    [
                        'title' => 'Подподпродукт 1.1',
                        'link' => 'menu_2-1-1',
                    ]
                ],
                [
                    [
                        'title' => 'Подподподпродукт 1.1.1',
                        'link' => 'menu_2-1-1-1',
                    ]
                ],
            ]
        ]
    ],
    [
        'title' => 'Продукт 3',
        'link' => 'menu_3',
    ]
];

function createMenu($menu)
{
    echo '<ul>';
    foreach ($menu as $value) {
        echo '<li>';
        echo "<a href='{$value['link']}'> {$value['title']} </a>";
        if (isset($value['children'])) {
            createMenu($value['children']);
        }
        echo '</li>';
    }
    echo '</ul>';
}

//////////////////////////////////////////// Задание 6///////////////////////////////////////////////////////////////////

function fun6($dict)
{
    foreach ($dict as $reg => $cities) {
        $array = array();
        echo "<h4>{$reg}:<br></h4>";
        foreach ($cities as $city) {
            if (preg_match('/К/', $city)) {
               $array[] = $city ;
            }
        }
        echo implode(', ', $array) . '.';
        echo '<br>';
        unset($array);
    }
}

///////////////////////////////////////////////////////////////////////////////////////////////////////////////


include('sample.php'); // сюда включаем шаблон (без php)
